DataProcessors/бит_КорректировкаДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_КорректировкаДвижений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Регистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕстьДвижения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отображение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отрисован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочитан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБП20</Name>
					<Comment>Префикс для формирования номера документов (БП 2.0)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяемыйЛьготныйТерриториальныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетНомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СамостоятельнаяКлассификационнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_КорректировкаДвижений/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ПередЗакрытием; // Обработывать или нет действия перед закрытием формы.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДокументСсылка") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = Параметры.ДокументСсылка;
	
	Заголовок = "Движения документа: " + Строка(ДокументСсылка);
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ЗаполнитьСтруктуруШапкиДокумента(МетаданныеДокумента);
	
	СтруктураШапки.Проведен = ДокументСсылка.Проведен;
	
	Если НЕ СтруктураШапки.Проведен 
		И (НЕ СтруктураШапки.Свойство("РучнаяКорректировка") ИЛИ НЕ СтруктураШапки.РучнаяКорректировка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапки.Свойство("РучнаяКорректировка") Тогда
		Объект.РучнаяКорректировка = СтруктураШапки.РучнаяКорректировка;
	Иначе
		Элементы.РучнаяКорректировка.Видимость    = Ложь;
		Элементы.КнопкаЗаписатьИЗакрыть.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьТаблицуРегистров(МетаданныеДокумента);
	СоздатьРеквизитыФормы();
	ПрочитатьЗаписиРегистров();
	СоздатьЭлементыФормы();
	
	УстановитьВозможностьРедактированияЗаписей();
	
	Если (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВводНачальныхОстатков")) Тогда
		Период = КонецМесяца(СтруктураШапки.Дата) + 1;
	Иначе
		Период = СтруктураШапки.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ СтруктураШапки.Проведен 
		И (НЕ СтруктураШапки.Свойство("РучнаяКорректировка") ИЛИ НЕ СтруктураШапки.РучнаяКорректировка) Тогда 
		
		ТекстПредупреждения = НСтр("ru='Документ не проведен.
		|Для получения информации о результатах проведения документ необходимо провести.'");

		Отказ = Истина;
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), ТекстПредупреждения);
        Возврат;
		
	КонецЕсли;
	
	ПриОткрытииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(ДополнительныеПараметры) Экспорт
    
    ПриОткрытииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииФрагмент()
    
    ПередЗакрытием = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ПовторноеОткрытиеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 08.09.2016 18:04:23 Начало правки...
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru = 'Остались не сохраненные изменения движений.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 08.09.2016 18:04:23 Конец правки.
	
	Если Модифицированность Тогда
		
		Если ПередЗакрытием = Истина Тогда
			
			ТекстВопроса = НСтр("ru = 'Сохранить изменения движений?'");
			
			Отказ = Истина;
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, ,КодВозвратаДиалога.Да);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьДвижения(Ложь);
		
		ПередЗакрытием = Ложь;	
		ЭтаФорма.Закрыть();
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ПередЗакрытием = Ложь;	
		ЭтаФорма.Закрыть();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	ВыполнитьДействияПриИзмененииРучнойКорректировки();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТаблицыФормыХозрасчетный

&НаКлиенте
Процедура ХозрасчетныйСчетДтПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Хозрасчетный.ТекущиеДанные;
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3, Организация",
	"СубконтоДт1", "СубконтоДт2", "СубконтоДт3", СтрокаТаблицы.Организация);
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаТаблицы.СчетДт, СтрокаТаблицы, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Дт", 1, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Дт", 2, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Дт", 3, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСчетКтПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Хозрасчетный.ТекущиеДанные;
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3, Организация",
	"СубконтоКт1", "СубконтоКт2", "СубконтоКт3", СтрокаТаблицы.Организация);
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаТаблицы.СчетКт, СтрокаТаблицы, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоКт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Кт", 1, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоКт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Кт", 2, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозрасчетныйСубконтоКт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто("Кт", 3, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	
	ИзмененаРучнаяКорректировка = СтруктураШапки.Свойство("РучнаяКорректировка")
	И (СтруктураШапки.РучнаяКорректировка <> Объект.РучнаяКорректировка);
	
	Если СтруктураШапки.Свойство("РучнаяКорректировка")
		И СтруктураШапки.РучнаяКорректировка
		И НЕ Объект.РучнаяКорректировка Тогда
		
		ТекстВопроса = НСтр("ru='Ручная корректировка движений документа отменена.
		|Восстановить движения, сформированные автоматически?'");
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтотОбъект, Новый Структура("ИзмененаРучнаяКорректировка, Отказ", ИзмененаРучнаяКорректировка, Отказ)), ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьИЗакрытьФрагмент(ИзмененаРучнаяКорректировка, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИзмененаРучнаяКорректировка = ДополнительныеПараметры.ИзмененаРучнаяКорректировка;
	Отказ = ДополнительныеПараметры.Отказ;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.РучнаяКорректировка = Истина;
		УстановитьВозможностьРедактированияЗаписей();
		Возврат;
	КонецЕсли;
	
	
	ЗаписатьИЗакрытьФрагмент(ИзмененаРучнаяКорректировка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьФрагмент(Знач ИзмененаРучнаяКорректировка, Знач Отказ)
	
	ЗаписатьДвижения(Отказ);
	
	Если НЕ Отказ Тогда
		
		Если ИзмененаРучнаяКорректировка Тогда
			ОповеститьОбИзменении(ДокументСсылка);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Ложь;
		
		Оповестить("ИзмененФлагРучнаяКорректировка",Новый Структура("ДокументСсылка",ДокументСсылка));
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьХозрасчетный(Команда)
	
	ОбновитьХозрасчетныйНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройку(Команда)
	
	СписокДвижений  = Новый СписокЗначений;
	СписокРегистров = Новый СписокЗначений;
	Для каждого СтрокаРегистра Из Объект.Регистры Цикл
		СписокДвижений.Добавить(СтрокаРегистра.Имя, , СтрокаРегистра.ЕстьДвижения);
		СписокРегистров.Добавить(СтрокаРегистра.Имя, СтрокаРегистра.Синоним, СтрокаРегистра.Отображение);
	КонецЦикла;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокДвижений", СписокДвижений);
	СтруктураПараметров.Вставить("СписокРегистров", СписокРегистров);
	
	СписокРезультат = Неопределено;
	
	
	ОткрытьФорму("Обработка.КорректировкаДвижений.Форма.ФормаНастройки", СтруктураПараметров, ЭтаФорма,,,, Новый ОписаниеОповещения("ОткрытьНастройкуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СписокРезультат = Результат;
	
	Если ТипЗнч(СписокРезультат) = Тип("СписокЗначений") Тогда
		
		БылиИзменения = Ложь;
		Для каждого СтрокаРегистра Из Объект.Регистры Цикл
			СтрокаСписка = СписокРезультат.НайтиПоЗначению(СтрокаРегистра.Имя);
			Если СтрокаРегистра.Отображение <> СтрокаСписка.Пометка Тогда
				БылиИзменения = Истина;
				СтрокаРегистра.Отображение = СтрокаСписка.Пометка;
			КонецЕсли;
		КонецЦикла;
		
		Если БылиИзменения Тогда
			
			ВыполнитьДействияПриИзмененииСоставаРегистров();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, ТекущиеДанные, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		Если ТипЗнч(ТекущиеДанные[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", ТекущиеДанные[ИмяПоля]);
		ИначеЕсли ТипЗнч(ТекущиеДанные[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов")Тогда
			СписокПараметров.Вставить("ДоговорКонтрагента", ТекущиеДанные[ИмяПоля]);
		ИначеЕсли ТипЗнч(ТекущиеДанные[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", ТекущиеДанные[ИмяПоля]);
		ИначеЕсли ТипЗнч(ТекущиеДанные[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", ТекущиеДанные[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Вставить("ОстаткиОбороты", "Кт");
	СписокПараметров.Вставить("Организация"   , ТекущиеДанные["Организация"]);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьНачалоВыбораСубконто(ДтКт, НомерСубконто, Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные     = Элементы.Хозрасчетный.ТекущиеДанные;
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, ТекущиеДанные, "Субконто" + ДтКт + "%Индекс%");
	
	// Выбор партии или документа расчетов.
	
	ПараметрыДокумента.Вставить("СчетУчета", ТекущиеДанные["Счет" + ДтКт]);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	// Выбор других типов, связанных с организацией / контрагентом.
	ЗначениеСубконто = ТекущиеДанные["Субконто" + ДтКт + НомерСубконто];
	ТипСубконто      = ТипЗнч(ЗначениеСубконто);
	
	Если ТипСубконто = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаВыбора = ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаВыбора",,Элемент);
		ФормаВыбора.НачальноеЗначениеВыбора = ЗначениеСубконто;		
		
		Если ПараметрыДокумента.Свойство("Контрагент") Тогда
			
			Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Эл.ПравоеЗначение   = ПараметрыДокумента.Организация;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		
		// БИТ_ЖКХ 03.03.2014
	ИначеЕсли ТипСубконто = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаВыбора = ОткрытьФорму("Справочник.ПодразделенияОрганизаций.Форма.ФормаВыбора",,Элемент);
		ФормаВыбора.НачальноеЗначениеВыбора = ЗначениеСубконто;		
		
		Если ПараметрыДокумента.Свойство("Контрагент") Тогда
			
			Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Эл.ПравоеЗначение   = ПараметрыДокумента.Организация;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		
	ИначеЕсли ТипСубконто = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаВыбора = ОткрытьФорму("Справочник.ПодразделенияОрганизаций.Форма.ФормаВыбора",,Элемент);
		ФормаВыбора.НачальноеЗначениеВыбора = ЗначениеСубконто;		
		
		Если ПараметрыДокумента.Свойство("Контрагент") Тогда
			
			Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Эл.ПравоеЗначение   = ПараметрыДокумента.Контрагент;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		// БИТ_ЖКХ 03.03.2014
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвижения(Отказ)
	
	Если Объект.РучнаяКорректировка Тогда
		
		Попытка
			НачатьТранзакцию();
			Если НЕ СтруктураШапки.РучнаяКорректировка Тогда
				ДокОбъект = ДокументСсылка.ПолучитьОбъект();
				ДокОбъект.РучнаяКорректировка = Истина;
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			СтрокиСДвижениями = Объект.Регистры.НайтиСтроки(Новый Структура("ЕстьДвижения", Истина));
			
			Для каждого СтрокаРегистра Из Объект.Регистры Цикл
				ЗаписыватьНабор = СтрокаРегистра.ЕстьДвижения ИЛИ (ЭтаФорма[СтрокаРегистра.Имя].Количество() > 0);
				Если ЗаписыватьНабор Тогда
					НаборЗаписей = РеквизитФормыВЗначение(СтрокаРегистра.Имя);
					Если СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
						Если Метаданные.РегистрыСведений[СтрокаРегистра.Имя].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора Тогда
							СтрокаРеквизитов = "Период, Активность";
						ИначеЕсли Метаданные.РегистрыСведений[СтрокаРегистра.Имя].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
							СтрокаРеквизитов = "Активность";
						Иначе
							СтрокаРеквизитов = "Период, Активность";
						КонецЕсли;
					Иначе 
						СтрокаРеквизитов = "Период, Активность";
					КонецЕсли;
					ТаблицаЗаписей = НаборЗаписей.Выгрузить(, СтрокаРеквизитов);
					Если ТаблицаЗаписей.Колонки.Найти("Период") <> Неопределено Тогда
						ТаблицаЗаписей.ЗаполнитьЗначения(СтруктураШапки.Дата, "Период");
					КонецЕсли;
					ТаблицаЗаписей.ЗаполнитьЗначения(Истина, "Активность");
					Для каждого Колонка Из ТаблицаЗаписей.Колонки Цикл
						Массив = ТаблицаЗаписей.ВыгрузитьКолонку(Колонка.Имя);
						НаборЗаписей.ЗагрузитьКолонку(Массив, Колонка.Имя);
					КонецЦикла;
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = НСтр("ru='Не удалось записать движения документа %1: %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка(ДокументСсылка), ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументСсылка);
			ИмяСобытия = НСтр("ru = 'Ошибка записи движений документа'");
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Иначе
		
		Попытка
			ДокОбъект = ДокументСсылка.ПолучитьОбъект();
			Если СтруктураШапки.РучнаяКорректировка Тогда
				ДокОбъект.РучнаяКорректировка = Ложь;
			КонецЕсли;

			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось перепровести документ %1: %2'") + Символы.ПС + НСтр("ru='Проведение документа отменено.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка(ДокументСсылка),  ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументСсылка);
			
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ИмяСобытия = НСтр("ru = 'Ошибка перепроведения документа'");
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
		УстановитьДоступностьСубконто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияПриИзмененииСоставаРегистров()
	
	СоздатьЭлементыФормы();
	
	УстановитьВозможностьРедактированияЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьХозрасчетныйНаСервере()
	
	ИмяРегистра = "Хозрасчетный";
	МассивРегистров = Объект.Регистры.НайтиСтроки(Новый Структура("Имя", ИмяРегистра));
	Если МассивРегистров.Количество() = 1 Тогда
		СтрокаРегистра = МассивРегистров[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ СтруктураШапки.Свойство("РучнаяКорректировка") ИЛИ НЕ СтруктураШапки.РучнаяКорректировка Тогда
		НаборЗаписей = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		
		Если СтрокаРегистра.ЕстьДвижения Тогда
			НаборЗаписей.Прочитать();
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(НаборЗаписей, ИмяРегистра);
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьСубконто();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьНаличиеДвижений(МетаданныеДокумента = Неопределено)
	
	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = ДокументСсылка.Метаданные();
	КонецЕсли;
	
	Если МетаданныеДокумента.Движения.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Для Каждого Движение ИЗ МетаданныеДокумента.Движения Цикл
		// В запросе получаем имена регистров, по которым есть хотя бы одно движение.
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + Движение.ПолноеИмя() +  """ КАК Имя ИЗ "
		+ Движение.ПолноеИмя() + " ГДЕ Регистратор = &Регистратор";
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуРегистров(МетаданныеДокумента = Неопределено)
	
	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = ДокументСсылка.Метаданные();
	КонецЕсли;
	
	ТаблицаДвижений = ОпределитьНаличиеДвижений(МетаданныеДокумента);
	ТаблицаДвижений.Индексы.Добавить("Имя");
	
	Объект.Регистры.Очистить();
	
	Для каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
		
		Строка = Объект.Регистры.Добавить();
		Строка.Имя = МетаданныеРегистра.Имя;
		
		ПолноеИмя = МетаданныеРегистра.ПолноеИмя();
		
		ПозицияТочки = Найти(ПолноеИмя, ".");
		ТипРегистра = Лев(ПолноеИмя, ПозицияТочки - 1);
		Строка.ТипРегистра = ТипРегистра;
		Строка.Синоним = МетаданныеРегистра.Синоним;
		
		Строка.ЕстьДвижения = ТаблицаДвижений.Найти(ПолноеИмя, "Имя") <> Неопределено;
		Строка.Отображение = Строка.ЕстьДвижения;
		
	КонецЦикла;
	
	// Первым показывается регистр бухгалтерии, затем регистры накопления, затем - сведений.
	Объект.Регистры.Сортировать("ТипРегистра, Синоним");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы()
	
	ПоказатьХозрасчетный = Ложь;
	ПоказатьКнигаУчетаДоходовИРасходов = Ложь;
	ПоказатьРасшифровкаКУДиР = Ложь;
	
	Для каждого СтрокаРегистра Из Объект.Регистры Цикл
		
		Если СтрокаРегистра.Имя = "Хозрасчетный" Тогда
			ПоказатьХозрасчетный = СтрокаРегистра.Отображение;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаРегистра.Имя = "КнигаУчетаДоходовИРасходов" Тогда
			ПоказатьКнигаУчетаДоходовИРасходов = СтрокаРегистра.Отображение;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаРегистра.Имя = "РасшифровкаКУДиР" Тогда
			ПоказатьРасшифровкаКУДиР = СтрокаРегистра.Отображение;
			Продолжить;
		КонецЕсли;
		
		// Создаем страницу для регистра в "правильном" месте между "предопределенными" закладками.
		ИмяГруппы = "Группа" + СтрокаРегистра.Имя;
		ТекГруппа = Элементы.Найти(ИмяГруппы);
		Если ТекГруппа = Неопределено Тогда
			Если СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
				ТекГруппа = Элементы.Вставить(
				ИмяГруппы,
				Тип("ГруппаФормы"),
				Элементы.ГруппаДвиженияРегистров);
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
				ТекГруппа = Элементы.Вставить(
				ИмяГруппы,
				Тип("ГруппаФормы"),
				Элементы.ГруппаДвиженияРегистров);
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
				ТекГруппа = Элементы.Вставить(
				ИмяГруппы,
				Тип("ГруппаФормы"),
				Элементы.ГруппаДвиженияРегистров);
			Иначе
				Продолжить;
			КонецЕсли;
			ТекГруппа.Заголовок = СтрокаРегистра.Синоним;
		КонецЕсли;
		
		// Делаем страницу регистра невидимой, если она не нужна.
		ТекГруппа.Видимость = СтрокаРегистра.Отображение;
		Если НЕ СтрокаРегистра.Отображение Тогда
			Продолжить;
		КонецЕсли;
		
		// На странице регистра создаем таблицу.
		ИмяТаблицы = СтрокаРегистра.Имя;
		ТекТаблица = Элементы.Найти(ИмяТаблицы);
		Если ТекТаблица <> Неопределено Тогда
			Элементы.Удалить(ТекТаблица);
		КонецЕсли;
		ТекТаблица = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), ТекГруппа);
		ТекТаблица.ПутьКДанным = СтрокаРегистра.Имя;
		
		ТекТаблица.ПутьКДаннымКартинкиСтроки = СтрокаРегистра.Имя + ".Активность";
		Если СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
			ТекТаблица.КартинкаСтрок = БиблиотекаКартинок.бит_АктивностьПоРБ;
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
			ТекТаблица.КартинкаСтрок = БиблиотекаКартинок.бит_АктивностьПоРН;
			ТекТаблица.ПутьКДаннымКартинкиСтроки = СтрокаРегистра.Имя + ".КартинкаСтроки";
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
			ТекТаблица.КартинкаСтрок = БиблиотекаКартинок.бит_АктивностьПоРС;
		КонецЕсли;
		
		// В командной панели страницы создаем кнопку "Найти в списке".
		ТекКоманда = Команды.Найти(ИмяТаблицы + "НайтиВСписке");
		Если ТекКоманда = Неопределено Тогда
			ТекКоманда = Команды.Добавить(ИмяТаблицы + "НайтиВСписке");
			ТекКоманда.Действие 		= "РегистрНайтиВСписке";
			ТекКоманда.Заголовок 		= НСтр("ru='Найти в списке'");
			ТекКоманда.Картинка 		= БиблиотекаКартинок.НайтиВСписке;
			ТекКоманда.Отображение		= ОтображениеКнопки.Картинка;
		КонецЕсли;
		ТекГруппаКнопок = Элементы.Добавить("Группа" + ИмяТаблицы + "НайтиВСписке", Тип("ГруппаФормы"), ТекТаблица.КоманднаяПанель);
		ТекГруппаКнопок.Вид 		= ВидГруппыФормы.ГруппаКнопок;
		ТекГруппаКнопок.Заголовок 	= НСтр("ru='Найти в списке'");
		ТекКнопка = Элементы.Добавить(ИмяТаблицы + "НайтиВСписке", Тип("КнопкаФормы"), ТекГруппаКнопок);
		ТекКнопка.ИмяКоманды 		= ТекКоманда.Имя;  
		ТекКнопка.Заголовок			= НСтр("ru='Найти в списке'");
		
		// Назначаем общий обработчик.
		ТекТаблица.УстановитьДействие("ПриНачалеРедактирования", "ТаблицаРегистраПриНачалеРедактирования");
		
		// Определяем набор колонок для таблицы, соответствующих метаданным регистра.
		Если СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
			НаборЗаписей = РегистрыНакопления[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
			НаборЗаписей = РегистрыСведений[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
			НаборЗаписей = РегистрыБухгалтерии[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		КонецЕсли;
		РеквизитыНабораЗаписей = НаборЗаписей.ВыгрузитьКолонки();
		
		// Некоторые колонки не надо показывать.
		РеквизитыНабораЗаписей.Колонки.Удалить("Регистратор");
		РеквизитыНабораЗаписей.Колонки.Удалить("Активность");
		Если РеквизитыНабораЗаписей.Колонки.Найти("МоментВремени") <> Неопределено Тогда
			РеквизитыНабораЗаписей.Колонки.Удалить("МоментВремени");
		КонецЕсли;
		Если РеквизитыНабораЗаписей.Колонки.Найти("Организация") <> Неопределено Тогда
			РеквизитыНабораЗаписей.Колонки.Удалить("Организация");
		КонецЕсли;
		
		// Создаем колонки таблицы.
		Для каждого КолонкаРеквизита Из РеквизитыНабораЗаписей.Колонки Цикл
			ИмяКолонки = СтрокаРегистра.Имя + КолонкаРеквизита.Имя;
			ТекКолонка = Элементы.Найти(ИмяКолонки);
			Если ТекКолонка = Неопределено Тогда
				ТекКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТекТаблица);
				
				Если КолонкаРеквизита.Имя = "ВидДвижения"
					И КолонкаРеквизита.ТипЗначения.Типы()[0] = Тип("ВидДвиженияНакопления") Тогда
					ТекКолонка.УстановитьДействие("ПриИзменении", "ВидДвиженияПриИзменении");
				КонецЕсли;
			КонецЕсли;
			ТекКолонка.ПутьКДанным = СтрокаРегистра.Имя + "." + КолонкаРеквизита.Имя;
			ТекКолонка.Вид = ВидПоляФормы.ПолеВвода;
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.ГруппаХозрасчетный.Видимость = ПоказатьХозрасчетный;
	Элементы.ГруппаКнигаУчетаДоходовИРасходов.Видимость = ПоказатьКнигаУчетаДоходовИРасходов;
	Элементы.ГруппаРасшифровкаКУДиР.Видимость = ПоказатьРасшифровкаКУДиР;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСубконто()
	
	Для Каждого Проводка Из Хозрасчетный Цикл
		
		ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДт1", "СубконтоДт2", "СубконтоДт3");
		УстановитьДоступностьСубконтоНаСервере(Проводка.СчетДт, Проводка, ПоляОбъекта);
		
		ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоКт1", "СубконтоКт2", "СубконтоКт3");
		УстановитьДоступностьСубконтоНаСервере(Проводка.СчетКт, Проводка, ПоляОбъекта);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура установки доступности субконто в зависимости от выбранного счета.
//
Процедура УстановитьДоступностьСубконтоНаСервере(Счет, Объект, ПоляОбъекта)
	
	ДанныеСчета = ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По 3 Цикл
		Если ПоляОбъекта.Свойство("Субконто" + Индекс) Тогда
			Объект[ПоляОбъекта["Субконто" + Индекс] + "Доступность"] = (Индекс <= ДанныеСчета.КоличествоСубконто);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваСчета(Знач Счет)
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	
	МаксКоличествоСубконто = Метаданные.ПланыСчетов.Хозрасчетный.МаксКоличествоСубконто;
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка,
	|	Хозрасчетный.Родитель,
	|	Хозрасчетный.Код,
	|	Хозрасчетный.Наименование,
	|	Хозрасчетный.Вид,
	|	Хозрасчетный.Забалансовый,
	|	Хозрасчетный.ЗапретитьИспользоватьВПроводках,
	|	Хозрасчетный.Валютный,
	|	Хозрасчетный.Количественный,
	|	Хозрасчетный.УчетПоПодразделениям,
	|	Хозрасчетный.НалоговыйУчет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ХозрасчетныйВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	ХозрасчетныйВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйВидыСубконто.НомерСтроки";
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
	
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
	
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
	
	ИндексСубконто	= 0;
	
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат ДанныеСчета;
	
КонецФункции

&НаСервере
Процедура УстановитьВозможностьРедактированияЗаписей()
	
	Для каждого ЭлементФормы Из Элементы.ГруппаДвиженияРегистров.ПодчиненныеЭлементы Цикл
		ЭлементФормы.ТолькоПросмотр = НЕ Объект.РучнаяКорректировка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыФормы()
	
	НовыеРеквизиты        = Новый Массив;
	УдаляемыеРеквизиты    = Новый Массив;
	СуществующиеРеквизиты = ПолучитьРеквизиты();
	
	Для каждого СтрокаРегистра Из Объект.Регистры Цикл
		
		Если СтрокаРегистра.Имя = "Хозрасчетный"
			ИЛИ СтрокаРегистра.Имя = "КнигаУчетаДоходовИРасходов"
			ИЛИ СтрокаРегистра.Имя = "РасшифровкаКУДиР" Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Реквизит Из СуществующиеРеквизиты Цикл
			Если Реквизит.Имя = СтрокаРегистра.Имя Тогда
				УдаляемыеРеквизиты.Добавить(СтрокаРегистра.Имя);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТипРеквизита = Новый ОписаниеТипов(СтрокаРегистра.ТипРегистра + "НаборЗаписей." + СтрокаРегистра.Имя);
		
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(СтрокаРегистра.Имя, ТипРеквизита, , , Истина));
		
		Если СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
			КартинкаСтроки = Новый РеквизитФормы("КартинкаСтроки", Новый ОписаниеТипов("Число"), СтрокаРегистра.Имя);
			НовыеРеквизиты.Добавить(КартинкаСтроки);
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизиты, УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗаписиРегистров()
	
	Для Каждого СтрокаРегистра Из Объект.Регистры Цикл
		
		Если СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
			НаборЗаписей = РегистрыНакопления[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
			НаборЗаписей = РегистрыСведений[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
			НаборЗаписей = РегистрыБухгалтерии[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
		КонецЕсли;
		
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		
		Если СтрокаРегистра.ЕстьДвижения Тогда
			НаборЗаписей.Прочитать();
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(НаборЗаписей, СтрокаРегистра.Имя);
		
		Если СтрокаРегистра.ТипРегистра = "РегистрНакопления"
			И СтрокаРегистра.Имя <> "КнигаУчетаДоходовИРасходов"
			И СтрокаРегистра.Имя <> "РасшифровкаКУДиР" Тогда
			Если Метаданные.РегистрыНакопления[СтрокаРегистра.Имя].ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
				Для Каждого Запись Из ЭтаФорма[СтрокаРегистра.Имя] Цикл
					Запись.КартинкаСтроки = ?(Запись.Активность, 0, 1);
				КонецЦикла;
			Иначе 
				Для Каждого Запись Из ЭтаФорма[СтрокаРегистра.Имя] Цикл
					Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						Запись.КартинкаСтроки = 2 + ?(Запись.Активность, 0, 1);
					Иначе
						Запись.КартинкаСтроки = 4 + ?(Запись.Активность, 0, 1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УстановитьДоступностьСубконто();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруШапкиДокумента(МетаданныеДокумента = Неопределено)
	
	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = ДокументСсылка.Метаданные();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номер,
	|	Дата,
	|	Проведен,
	|	ПометкаУдаления";
	Для каждого РеквизитДокумента Из МетаданныеДокумента.Реквизиты Цикл
		ТекстЗапроса = ТекстЗапроса + ",
		|" + РеквизитДокумента.Имя;
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	Документ." + МетаданныеДокумента.Имя + " КАК Док
	|ГДЕ
	|	Ссылка = &ДокументСсылка";
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	ТаблицаШапки = Запрос.Выполнить().Выгрузить();
	СтруктураШапки = Новый Структура;
	Для каждого Колонка Из ТаблицаШапки.Колонки Цикл
		СтруктураШапки.Вставить(Колонка.Имя, ТаблицаШапки[0][Колонка.Имя]);
	КонецЦикла;
	
	Если СтруктураШапки.Свойство("Организация") И СтруктураШапки.Свойство("Дата") Тогда
		
		Если (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВводНачальныхОстатков")) Тогда
			Период = КонецМесяца(СтруктураШапки.Дата) + 1;
		Иначе
			Период = СтруктураШапки.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторноеОткрытиеСервер()
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ЗаполнитьСтруктуруШапкиДокумента(МетаданныеДокумента);
	
	Если СтруктураШапки.Свойство("РучнаяКорректировка") Тогда
		Объект.РучнаяКорректировка = СтруктураШапки.РучнаяКорректировка;
	Иначе
		Элементы.РучнаяКорректировка.Видимость    = Ложь;
		Элементы.КнопкаЗаписатьИЗакрыть.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьТаблицуРегистров(МетаданныеДокумента);
	СоздатьРеквизитыФормы();
	ПрочитатьЗаписиРегистров();
	СоздатьЭлементыФормы();
	
	УстановитьВозможностьРедактированияЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияПриИзмененииРучнойКорректировки()
	
	УстановитьВозможностьРедактированияЗаписей();
	
	Если СтруктураШапки.РучнаяКорректировка = Объект.РучнаяКорректировка Тогда
		ПрочитатьЗаписиРегистров();
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьДействияПриИзмененииРучнойКорректировки()

// Общая процедура для всех регистров. Устанавливает организацию в добавляемых строках.
//
&НаКлиенте
Процедура ТаблицаРегистраПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НоваяСтрока И НЕ Копирование Тогда
		Если ТекущиеДанные.Свойство("Организация")
			И СтруктураШапки.Свойство("Организация") Тогда
			ТекущиеДанные.Организация = СтруктураШапки.Организация;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("Период")
			И СтруктураШапки.Свойство("Дата") Тогда
			ТекущиеДанные.Период = СтруктураШапки.Дата;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("ХарактерДеятельности")
			И СтруктураШапки.Свойство("ХарактерДеятельности")
			И ТекущиеДанные.Свойство("НоменклатурнаяГруппа")
			И СтруктураШапки.Свойство("НоменклатурнаяГруппа") Тогда
			ТекущиеДанные.ХарактерДеятельности = СтруктураШапки.ХарактерДеятельности;
			ТекущиеДанные.НоменклатурнаяГруппа = СтруктураШапки.НоменклатурнаяГруппа;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("КартинкаСтроки")Тогда
		Если ТекущиеДанные.Свойство("ВидДвижения") Тогда 
			Если ТекущиеДанные.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				ТекущиеДанные.КартинкаСтроки = 2 + ?(ТекущиеДанные.Активность, 0, 1);
			Иначе
				ТекущиеДанные.КартинкаСтроки = 4 + ?(ТекущиеДанные.Активность, 0, 1);
			КонецЕсли;
		Иначе
			ТекущиеДанные.КартинкаСтроки = ?(ТекущиеДанные.Активность, 0, 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	
	Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы")
		И ТекущийЭлемент.ТекущиеДанные.Свойство("КартинкаСтроки") Тогда
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекущиеДанные.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			ТекущиеДанные.КартинкаСтроки = 2 + ?(ТекущиеДанные.Активность, 0, 1);
		Иначе
			ТекущиеДанные.КартинкаСтроки = 4 + ?(ТекущиеДанные.Активность, 0, 1);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыКлючаЗаписи(ПараметрыЗаписи)
	
	ПараметрыКлючаЗаписи = Новый Структура("КлючЗаписи, ТипРегистра");
	
	ИмяРегистра = ПараметрыЗаписи.ИмяРегистра;
	
	Если НЕ Метаданные.РегистрыБухгалтерии.Найти(ИмяРегистра) = Неопределено Тогда
		
		ПараметрыКлючаЗаписи.ТипРегистра = "РегистрБухгалтерии";
		
		Если ПараметрыЗаписи.Свойство("Регистратор") И ПараметрыЗаписи.Свойство("НомерСтроки") Тогда
			ЗначениеКлючаЗаписи = Новый Структура;
			ЗначениеКлючаЗаписи.Вставить("Регистратор", ПараметрыЗаписи.Регистратор);
			ЗначениеКлючаЗаписи.Вставить("НомерСтроки", ПараметрыЗаписи.НомерСтроки);
			ПараметрыКлючаЗаписи.КлючЗаписи = РегистрыБухгалтерии[ИмяРегистра].СоздатьКлючЗаписи(ЗначениеКлючаЗаписи);	
		КонецЕсли;
		
	ИначеЕсли НЕ Метаданные.РегистрыНакопления.Найти(ИмяРегистра) = Неопределено Тогда
		
		ПараметрыКлючаЗаписи.ТипРегистра = "РегистрНакопления";
		
		Если ПараметрыЗаписи.Свойство("Регистратор") И ПараметрыЗаписи.Свойство("НомерСтроки") Тогда
			ЗначениеКлючаЗаписи = Новый Структура;
			ЗначениеКлючаЗаписи.Вставить("Регистратор", ПараметрыЗаписи.Регистратор);
			ЗначениеКлючаЗаписи.Вставить("НомерСтроки", ПараметрыЗаписи.НомерСтроки);
			ПараметрыКлючаЗаписи.КлючЗаписи = РегистрыНакопления[ИмяРегистра].СоздатьКлючЗаписи(ЗначениеКлючаЗаписи);	
		КонецЕсли;
		
	ИначеЕсли НЕ Метаданные.РегистрыСведений.Найти(ИмяРегистра) = Неопределено Тогда
		
		ПараметрыКлючаЗаписи.ТипРегистра = "РегистрСведений";
		
		ЗначениеКлючаЗаписи = Новый Структура;
		Если НЕ Метаданные.РегистрыСведений[ИмяРегистра].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический 
			И ПараметрыЗаписи.Свойство("Период") Тогда
			ЗначениеКлючаЗаписи.Вставить("Период", 		ПараметрыЗаписи.Период); 	
		КонецЕсли;
		Если Метаданные.РегистрыСведений[ИмяРегистра].РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору
			И ПараметрыЗаписи.Свойство("Регистратор") Тогда
			ЗначениеКлючаЗаписи.Вставить("Регистратор", ПараметрыЗаписи.Регистратор); 	
		КонецЕсли;
		Для Каждого ИзмерениеРегистра ИЗ Метаданные.РегистрыСведений[ИмяРегистра].Измерения Цикл
			Если ПараметрыЗаписи.Свойство(ИзмерениеРегистра.Имя) Тогда
				ЗначениеКлючаЗаписи.Вставить(ИзмерениеРегистра.Имя, ПараметрыЗаписи[ИзмерениеРегистра.Имя]); 		
			КонецЕсли;
		КонецЦикла;
		ПараметрыКлючаЗаписи.КлючЗаписи = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(ЗначениеКлючаЗаписи);
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыКлючаЗаписи;
	
КонецФункции

&НаКлиенте
Процедура РегистрНайтиВСписке(Команда)
	
	ИмяРегистра = СтрЗаменить(Команда.Имя, "НайтиВСписке", "");
	
	// Проверим, что таблица регистра добавлена на форму.
	Если Элементы.Найти(ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяРегистра].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	// Установим отбор по организации документа.
	// В противном случае, в некоторых формах установится отбор по основной организации.
	Если СтруктураШапки.Свойство("Организация") Тогда
		ПараметрыОтбора = Новый Структура("Организация", СтруктураШапки.Организация);
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
	КонецЕсли;
	
	// Подготовим ключ записи для позиционирования в форме списка.
	ПараметрыТекущейЗаписи = Новый Структура;
	ПараметрыТекущейЗаписи.Вставить("ИмяРегистра", 			ИмяРегистра);
	ПараметрыТекущейЗаписи.Вставить("Регистратор",    		ДокументСсылка);
	Если СтруктураШапки.Свойство("Организация") Тогда
		ПараметрыТекущейЗаписи.Вставить("Организация",		СтруктураШапки.Организация);
	КонецЕсли;
	Для Каждого ЭлементФормыТабПоля ИЗ Элементы[ИмяРегистра].ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементФормыТабПоля) = Тип("ПолеФормы") Тогда
			ИмяСвойства = СтрЗаменить(ЭлементФормыТабПоля.Имя, ИмяРегистра, "");
			Если ИмяСвойства = "Регистратор" ИЛИ ИмяСвойства = "Организация" Тогда
				Продолжить;
			КонецЕсли;
			ПараметрыТекущейЗаписи.Вставить(ИмяСвойства, 	ТекущиеДанные[ИмяСвойства]);			
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыКлючаЗаписи = ПолучитьПараметрыКлючаЗаписи(ПараметрыТекущейЗаписи);
	Если ПараметрыКлючаЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипРегистра = ПараметрыКлючаЗаписи.ТипРегистра;
	ПараметрыФормы.Вставить("ТекущаяСтрока", 	ПараметрыКлючаЗаписи.КлючЗаписи);
	
	ОткрытьФорму(ТипРегистра + "." + ИмяРегистра + ".ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
